zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR0.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_K566_GPR0.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_K566_GPR0
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_K566_GPR0_H_)  /* Check if memory map has not been already included */
#define S32K566_K566_GPR0_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- K566_GPR0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup K566_GPR0_Peripheral_Access_Layer K566_GPR0 Peripheral Access Layer
 * @{
 */

/** K566_GPR0 - Register Layout Typedef */
typedef struct K566_GPR0_Struct {
  uint8_t RESERVED_0[4112];
  __IO uint32_t GPR_RWD_4;                         /**< Read Write DEST 4, offset: 0x1010 */
  uint8_t RESERVED_1[2028];
  __I  uint32_t GPR_ROD_0;                         /**< Read Only DEST 0, offset: 0x1800 */
  uint8_t RESERVED_2[4];
  __IO uint32_t GPR_ROD_2;                         /**< Read Only DEST 2, offset: 0x1808 */
  uint8_t RESERVED_3[2036];
  __IO uint32_t GPR_RWF_0;                         /**< Read Write FUNC 0, offset: 0x2000 */
  __IO uint32_t GPR_RWF_1;                         /**< Read Write FUNC 1, offset: 0x2004 */
  __IO uint32_t GPR_RWF_2;                         /**< Read Write FUNC 2, offset: 0x2008 */
  __IO uint32_t GPR_RWF_3;                         /**< Read Write FUNC 3, offset: 0x200C */
  __IO uint32_t GPR_RWF_4;                         /**< Read Write FUNC 4, offset: 0x2010 */
  __IO uint32_t GPR_RWF_5;                         /**< Read Write FUNC 5, offset: 0x2014 */
  __IO uint32_t GPR_RWF_6;                         /**< Read Write FUNC 6, offset: 0x2018 */
  uint8_t RESERVED_4[2020];
  __I  uint32_t GPR_ROF_0;                         /**< Read Only FUNC 0, offset: 0x2800 */
  __I  uint32_t GPR_ROF_1;                         /**< Read Only FUNC 1, offset: 0x2804 */
} K566_GPR0_Type, *K566_GPR0_MemMapPtr;

/** Number of instances of the K566_GPR0 module. */
#define K566_GPR0_INSTANCE_COUNT                 (1u)

/* K566_GPR0 - Peripheral instance base addresses */
/** Peripheral GPR_0 base address */
#define IP_GPR_0_BASE                            (0x40000000u)
/** Peripheral GPR_0 base pointer */
#define IP_GPR_0                                 ((K566_GPR0_Type *)IP_GPR_0_BASE)
/** Array initializer of K566_GPR0 peripheral base addresses */
#define IP_K566_GPR0_BASE_ADDRS                  { IP_GPR_0_BASE }
/** Array initializer of K566_GPR0 peripheral base pointers */
#define IP_K566_GPR0_BASE_PTRS                   { IP_GPR_0 }

/* ----------------------------------------------------------------------------
   -- K566_GPR0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup K566_GPR0_Register_Masks K566_GPR0 Register Masks
 * @{
 */

/*! @name GPR_RWD_4 - Read Write DEST 4 */
/*! @{ */

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN0_MASK  (0x1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN0_SHIFT (0U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN0_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN0(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN0_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN0_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN1_MASK  (0x2U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN1_SHIFT (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN1_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN1(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN1_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN1_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN2_MASK  (0x4U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN2_SHIFT (2U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN2_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN2(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN2_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN2_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN3_MASK  (0x8U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN3_SHIFT (3U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN3_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN3(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN3_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN3_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN4_MASK  (0x10U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN4_SHIFT (4U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN4_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN4(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN4_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN4_MASK)

