zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR0.h
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN5_MASK  (0x20U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN5_SHIFT (5U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN5_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN5(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN5_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN5_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN6_MASK  (0x40U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN6_SHIFT (6U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN6_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN6(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN6_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN6_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN7_MASK  (0x80U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN7_SHIFT (7U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN7_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN7(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN7_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN7_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN8_MASK  (0x100U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN8_SHIFT (8U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN8_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN8(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN8_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN8_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN9_MASK  (0x200U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN9_SHIFT (9U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN9_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN9(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN9_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN9_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN10_MASK (0x400U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN10_SHIFT (10U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN10_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN10(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN10_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN10_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN11_MASK (0x800U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN11_SHIFT (11U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN11_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN11(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN11_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN11_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN12_MASK (0x1000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN12_SHIFT (12U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN12_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN12(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN12_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN12_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN13_MASK (0x2000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN13_SHIFT (13U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN13_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN13(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN13_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_A_EN13_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN0_MASK  (0x4000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN0_SHIFT (14U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN0_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN0(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN0_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN0_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN1_MASK  (0x8000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN1_SHIFT (15U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN1_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN1(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN1_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN1_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN2_MASK  (0x10000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN2_SHIFT (16U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN2_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN2(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN2_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN2_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN3_MASK  (0x20000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN3_SHIFT (17U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN3_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN3(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN3_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN3_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN4_MASK  (0x40000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN4_SHIFT (18U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN4_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN4(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN4_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN4_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN5_MASK  (0x80000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN5_SHIFT (19U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN5_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN5(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN5_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN5_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN6_MASK  (0x100000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN6_SHIFT (20U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN6_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN6(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN6_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN6_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN7_MASK  (0x200000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN7_SHIFT (21U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN7_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN7(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN7_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN7_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN8_MASK  (0x400000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN8_SHIFT (22U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN8_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN8(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN8_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN8_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN9_MASK  (0x800000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN9_SHIFT (23U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN9_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN9(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN9_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN9_MASK)

#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN10_MASK (0x1000000U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN10_SHIFT (24U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN10_WIDTH (1U)
#define K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN10(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN10_SHIFT)) & K566_GPR0_GPR_RWD_4_FAULT_CH_B_EN10_MASK)

