zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR0.h
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE1_MASK (0x8000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE1_SHIFT (15U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE1_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE1(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE1_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE1_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE2_MASK (0x10000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE2_SHIFT (16U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE2_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE2(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE2_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE2_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE3_MASK (0x20000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE3_SHIFT (17U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE3_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE3(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE3_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE3_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE4_MASK (0x40000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE4_SHIFT (18U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE4_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE4(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE4_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE4_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE5_MASK (0x80000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE5_SHIFT (19U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE5_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE5(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE5_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE5_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE6_MASK (0x100000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE6_SHIFT (20U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE6_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE6(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE6_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE6_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE7_MASK (0x200000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE7_SHIFT (21U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE7_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE7(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE7_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE7_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE8_MASK (0x400000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE8_SHIFT (22U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE8_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE8(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE8_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE8_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE9_MASK (0x800000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE9_SHIFT (23U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE9_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE9(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE9_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE9_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE10_MASK (0x1000000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE10_SHIFT (24U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE10_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE10(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE10_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE10_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE11_MASK (0x2000000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE11_SHIFT (25U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE11_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE11(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE11_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE11_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE12_MASK (0x4000000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE12_SHIFT (26U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE12_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE12(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE12_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE12_MASK)

#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE13_MASK (0x8000000U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE13_SHIFT (27U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE13_WIDTH (1U)
#define K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE13(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE13_SHIFT)) & K566_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE13_MASK)
/*! @} */

/*! @name GPR_RWF_0 - Read Write FUNC 0 */
/*! @{ */

#define K566_GPR0_GPR_RWF_0_ETH0_REVMII_SEL_MASK (0x1U)
#define K566_GPR0_GPR_RWF_0_ETH0_REVMII_SEL_SHIFT (0U)
#define K566_GPR0_GPR_RWF_0_ETH0_REVMII_SEL_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_REVMII_SEL(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_REVMII_SEL_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_REVMII_SEL_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_REVMII_RATE_MASK (0x2U)
#define K566_GPR0_GPR_RWF_0_ETH0_REVMII_RATE_SHIFT (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_REVMII_RATE_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_REVMII_RATE(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_REVMII_RATE_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_REVMII_RATE_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY0_MASK (0x4U)
#define K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY0_SHIFT (2U)
#define K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY0_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY0(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY0_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY0_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY1_MASK (0x8U)
#define K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY1_SHIFT (3U)
#define K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY1_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY1(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY1_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RGMII_DELAY1_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_TX_DELAY_TUNE_MASK (0x1F0U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_DELAY_TUNE_SHIFT (4U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_DELAY_TUNE_WIDTH (5U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_DELAY_TUNE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_TX_DELAY_TUNE_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_TX_DELAY_TUNE_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_TX_PD_MASK      (0x200U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_PD_SHIFT     (9U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_PD_WIDTH     (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_PD(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_TX_PD_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_TX_PD_MASK)

