zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR0.h
#define K566_GPR0_GPR_RWF_0_ETH0_TX_BYPASS_DLL_MASK (0x400U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_BYPASS_DLL_SHIFT (10U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_BYPASS_DLL_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_BYPASS_DLL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_TX_BYPASS_DLL_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_TX_BYPASS_DLL_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_TX_STABLE_OVERRIDE_MASK (0x800U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_STABLE_OVERRIDE_SHIFT (11U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_STABLE_OVERRIDE_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_STABLE_OVERRIDE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_TX_STABLE_OVERRIDE_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_TX_STABLE_OVERRIDE_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_TX_CLK_PRESENT_CLR_MASK (0x1000U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_CLK_PRESENT_CLR_SHIFT (12U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_CLK_PRESENT_CLR_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_CLK_PRESENT_CLR(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_TX_CLK_PRESENT_CLR_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_TX_CLK_PRESENT_CLR_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_TX_LOCK_ERR_CLR_MASK (0x2000U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_LOCK_ERR_CLR_SHIFT (13U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_LOCK_ERR_CLR_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_LOCK_ERR_CLR(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_TX_LOCK_ERR_CLR_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_TX_LOCK_ERR_CLR_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_TX_EN_REQ_MASK  (0x4000U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_EN_REQ_SHIFT (14U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_EN_REQ_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_EN_REQ(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_TX_EN_REQ_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_TX_EN_REQ_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_TX_COUNTER_RST_MASK (0x8000U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_COUNTER_RST_SHIFT (15U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_COUNTER_RST_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_TX_COUNTER_RST(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_TX_COUNTER_RST_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_TX_COUNTER_RST_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RX_DELAY_TUNE_MASK (0x1F0000U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_DELAY_TUNE_SHIFT (16U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_DELAY_TUNE_WIDTH (5U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_DELAY_TUNE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RX_DELAY_TUNE_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RX_DELAY_TUNE_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RX_PD_MASK      (0x200000U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_PD_SHIFT     (21U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_PD_WIDTH     (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_PD(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RX_PD_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RX_PD_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RX_BYPASS_DLL_MASK (0x400000U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_BYPASS_DLL_SHIFT (22U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_BYPASS_DLL_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_BYPASS_DLL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RX_BYPASS_DLL_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RX_BYPASS_DLL_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RX_STABLE_OVERRIDE_MASK (0x800000U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_STABLE_OVERRIDE_SHIFT (23U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_STABLE_OVERRIDE_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_STABLE_OVERRIDE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RX_STABLE_OVERRIDE_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RX_STABLE_OVERRIDE_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RX_CLK_PRESENT_CLR_MASK (0x1000000U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_CLK_PRESENT_CLR_SHIFT (24U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_CLK_PRESENT_CLR_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_CLK_PRESENT_CLR(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RX_CLK_PRESENT_CLR_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RX_CLK_PRESENT_CLR_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RX_LOCK_ERR_CLR_MASK (0x2000000U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_LOCK_ERR_CLR_SHIFT (25U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_LOCK_ERR_CLR_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_LOCK_ERR_CLR(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RX_LOCK_ERR_CLR_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RX_LOCK_ERR_CLR_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RX_EN_REQ_MASK  (0x4000000U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_EN_REQ_SHIFT (26U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_EN_REQ_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_EN_REQ(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RX_EN_REQ_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RX_EN_REQ_MASK)

#define K566_GPR0_GPR_RWF_0_ETH0_RX_COUNTER_RST_MASK (0x8000000U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_COUNTER_RST_SHIFT (27U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_COUNTER_RST_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_ETH0_RX_COUNTER_RST(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_ETH0_RX_COUNTER_RST_SHIFT)) & K566_GPR0_GPR_RWF_0_ETH0_RX_COUNTER_RST_MASK)

#define K566_GPR0_GPR_RWF_0_CANXL_PS1_WAIT_MASK  (0x80000000U)
#define K566_GPR0_GPR_RWF_0_CANXL_PS1_WAIT_SHIFT (31U)
#define K566_GPR0_GPR_RWF_0_CANXL_PS1_WAIT_WIDTH (1U)
#define K566_GPR0_GPR_RWF_0_CANXL_PS1_WAIT(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_0_CANXL_PS1_WAIT_SHIFT)) & K566_GPR0_GPR_RWF_0_CANXL_PS1_WAIT_MASK)
/*! @} */

/*! @name GPR_RWF_1 - Read Write FUNC 1 */
/*! @{ */

#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC0_MASK     (0xFU)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC0_SHIFT    (0U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC0_WIDTH    (4U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC0(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_1_IO_VAR_MAC0_SHIFT)) & K566_GPR0_GPR_RWF_1_IO_VAR_MAC0_MASK)

#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC1_MASK     (0xF0U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC1_SHIFT    (4U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC1_WIDTH    (4U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC1(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_1_IO_VAR_MAC1_SHIFT)) & K566_GPR0_GPR_RWF_1_IO_VAR_MAC1_MASK)

#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC2_MASK     (0xF00U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC2_SHIFT    (8U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC2_WIDTH    (4U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC2(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_1_IO_VAR_MAC2_SHIFT)) & K566_GPR0_GPR_RWF_1_IO_VAR_MAC2_MASK)

#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC3_MASK     (0xF000U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC3_SHIFT    (12U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC3_WIDTH    (4U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC3(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_1_IO_VAR_MAC3_SHIFT)) & K566_GPR0_GPR_RWF_1_IO_VAR_MAC3_MASK)

#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC4_MASK     (0xF0000U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC4_SHIFT    (16U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC4_WIDTH    (4U)
#define K566_GPR0_GPR_RWF_1_IO_VAR_MAC4(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_1_IO_VAR_MAC4_SHIFT)) & K566_GPR0_GPR_RWF_1_IO_VAR_MAC4_MASK)

