zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR0.h
#define K566_GPR0_GPR_RWF_1_MPLLA_OWORD_CLK_MUX_SEL_MASK (0x100000U)
#define K566_GPR0_GPR_RWF_1_MPLLA_OWORD_CLK_MUX_SEL_SHIFT (20U)
#define K566_GPR0_GPR_RWF_1_MPLLA_OWORD_CLK_MUX_SEL_WIDTH (1U)
#define K566_GPR0_GPR_RWF_1_MPLLA_OWORD_CLK_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_1_MPLLA_OWORD_CLK_MUX_SEL_SHIFT)) & K566_GPR0_GPR_RWF_1_MPLLA_OWORD_CLK_MUX_SEL_MASK)

#define K566_GPR0_GPR_RWF_1_MPLLB_OWORD_CLK_MUX_SEL_MASK (0x200000U)
#define K566_GPR0_GPR_RWF_1_MPLLB_OWORD_CLK_MUX_SEL_SHIFT (21U)
#define K566_GPR0_GPR_RWF_1_MPLLB_OWORD_CLK_MUX_SEL_WIDTH (1U)
#define K566_GPR0_GPR_RWF_1_MPLLB_OWORD_CLK_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_1_MPLLB_OWORD_CLK_MUX_SEL_SHIFT)) & K566_GPR0_GPR_RWF_1_MPLLB_OWORD_CLK_MUX_SEL_MASK)

#define K566_GPR0_GPR_RWF_1_REF_DIG_CLK_MUX_SEL_MASK (0x400000U)
#define K566_GPR0_GPR_RWF_1_REF_DIG_CLK_MUX_SEL_SHIFT (22U)
#define K566_GPR0_GPR_RWF_1_REF_DIG_CLK_MUX_SEL_WIDTH (1U)
#define K566_GPR0_GPR_RWF_1_REF_DIG_CLK_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_1_REF_DIG_CLK_MUX_SEL_SHIFT)) & K566_GPR0_GPR_RWF_1_REF_DIG_CLK_MUX_SEL_MASK)

#define K566_GPR0_GPR_RWF_1_HSPI_CURR_INJ_CLEAR_MASK (0x80000000U)
#define K566_GPR0_GPR_RWF_1_HSPI_CURR_INJ_CLEAR_SHIFT (31U)
#define K566_GPR0_GPR_RWF_1_HSPI_CURR_INJ_CLEAR_WIDTH (1U)
#define K566_GPR0_GPR_RWF_1_HSPI_CURR_INJ_CLEAR(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_1_HSPI_CURR_INJ_CLEAR_SHIFT)) & K566_GPR0_GPR_RWF_1_HSPI_CURR_INJ_CLEAR_MASK)
/*! @} */

/*! @name GPR_RWF_2 - Read Write FUNC 2 */
/*! @{ */

#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC0_MASK (0xFU)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC0_SHIFT (0U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC0_WIDTH (4U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC0(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC0_SHIFT)) & K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC0_MASK)

#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC1_MASK (0xF0U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC1_SHIFT (4U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC1_WIDTH (4U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC1(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC1_SHIFT)) & K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC1_MASK)

#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC2_MASK (0xF00U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC2_SHIFT (8U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC2_WIDTH (4U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC2(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC2_SHIFT)) & K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC2_MASK)

#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC3_MASK (0xF000U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC3_SHIFT (12U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC3_WIDTH (4U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC3(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC3_SHIFT)) & K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC3_MASK)

#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC4_MASK (0xF0000U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC4_SHIFT (16U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC4_WIDTH (4U)
#define K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC4(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC4_SHIFT)) & K566_GPR0_GPR_RWF_2_MII_PROTOCOL_MAC4_MASK)
/*! @} */

/*! @name GPR_RWF_3 - Read Write FUNC 3 */
/*! @{ */

#define K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC0_MASK (0x3U)
#define K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC0_SHIFT (0U)
#define K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC0_WIDTH (2U)
#define K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC0(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC0_SHIFT)) & K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC0_MASK)

#define K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC1_MASK (0xCU)
#define K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC1_SHIFT (2U)
#define K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC1_WIDTH (2U)
#define K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC1(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC1_SHIFT)) & K566_GPR0_GPR_RWF_3_PCS_PROTOCOL_MAC1_MASK)

#define K566_GPR0_GPR_RWF_3_RTIS_REQ_MASK        (0x3FF0U)
#define K566_GPR0_GPR_RWF_3_RTIS_REQ_SHIFT       (4U)
#define K566_GPR0_GPR_RWF_3_RTIS_REQ_WIDTH       (10U)
#define K566_GPR0_GPR_RWF_3_RTIS_REQ(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_RTIS_REQ_SHIFT)) & K566_GPR0_GPR_RWF_3_RTIS_REQ_MASK)

#define K566_GPR0_GPR_RWF_3_CFG_IERB_LOCK_MASK   (0x8000U)
#define K566_GPR0_GPR_RWF_3_CFG_IERB_LOCK_SHIFT  (15U)
#define K566_GPR0_GPR_RWF_3_CFG_IERB_LOCK_WIDTH  (1U)
#define K566_GPR0_GPR_RWF_3_CFG_IERB_LOCK(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_CFG_IERB_LOCK_SHIFT)) & K566_GPR0_GPR_RWF_3_CFG_IERB_LOCK_MASK)

#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY0_MASK (0x10000U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY0_SHIFT (16U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY0_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY0(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY0_SHIFT)) & K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY0_MASK)

#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY1_MASK (0x20000U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY1_SHIFT (17U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY1_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY1(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY1_SHIFT)) & K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY1_MASK)

#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY2_MASK (0x40000U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY2_SHIFT (18U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY2_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY2(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY2_SHIFT)) & K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY2_MASK)

#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY3_MASK (0x80000U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY3_SHIFT (19U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY3_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY3(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY3_SHIFT)) & K566_GPR0_GPR_RWF_3_ENABLE_10BASET_PHY3_MASK)

#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY1_MASK  (0x100000U)
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY1_SHIFT (20U)
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY1_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY1(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY1_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY1_MASK)

#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY2_MASK  (0x200000U)
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY2_SHIFT (21U)
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY2_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY2(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY2_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY2_MASK)

