zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR0.h
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY3_MASK  (0x400000U)
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY3_SHIFT (22U)
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY3_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY3(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY3_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY0_MASK_PHY3_MASK)

#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY0_MASK  (0x800000U)
#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY0_SHIFT (23U)
#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY0_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY0(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY0_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY0_MASK)

#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY2_MASK  (0x1000000U)
#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY2_SHIFT (24U)
#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY2_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY2(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY2_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY2_MASK)

#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY3_MASK  (0x2000000U)
#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY3_SHIFT (25U)
#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY3_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY3(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY3_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY1_MASK_PHY3_MASK)

#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY0_MASK  (0x4000000U)
#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY0_SHIFT (26U)
#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY0_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY0(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY0_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY0_MASK)

#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY1_MASK  (0x8000000U)
#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY1_SHIFT (27U)
#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY1_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY1(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY1_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY1_MASK)

#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY3_MASK  (0x10000000U)
#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY3_SHIFT (28U)
#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY3_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY3(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY3_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY2_MASK_PHY3_MASK)

#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY0_MASK  (0x20000000U)
#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY0_SHIFT (29U)
#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY0_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY0(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY0_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY0_MASK)

#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY1_MASK  (0x40000000U)
#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY1_SHIFT (30U)
#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY1_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY1(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY1_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY1_MASK)

#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY2_MASK  (0x80000000U)
#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY2_SHIFT (31U)
#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY2_WIDTH (1U)
#define K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY2(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY2_SHIFT)) & K566_GPR0_GPR_RWF_3_PHY3_MASK_PHY2_MASK)
/*! @} */

/*! @name GPR_RWF_4 - Read Write FUNC 4 */
/*! @{ */

#define K566_GPR0_GPR_RWF_4_ETH1_REVMII_SEL_MASK (0x1U)
#define K566_GPR0_GPR_RWF_4_ETH1_REVMII_SEL_SHIFT (0U)
#define K566_GPR0_GPR_RWF_4_ETH1_REVMII_SEL_WIDTH (1U)
#define K566_GPR0_GPR_RWF_4_ETH1_REVMII_SEL(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_4_ETH1_REVMII_SEL_SHIFT)) & K566_GPR0_GPR_RWF_4_ETH1_REVMII_SEL_MASK)

#define K566_GPR0_GPR_RWF_4_ETH1_REVMII_RATE_MASK (0x2U)
#define K566_GPR0_GPR_RWF_4_ETH1_REVMII_RATE_SHIFT (1U)
#define K566_GPR0_GPR_RWF_4_ETH1_REVMII_RATE_WIDTH (1U)
#define K566_GPR0_GPR_RWF_4_ETH1_REVMII_RATE(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_4_ETH1_REVMII_RATE_SHIFT)) & K566_GPR0_GPR_RWF_4_ETH1_REVMII_RATE_MASK)

#define K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY0_MASK (0x4U)
#define K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY0_SHIFT (2U)
#define K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY0_WIDTH (1U)
#define K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY0(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY0_SHIFT)) & K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY0_MASK)

#define K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY1_MASK (0x8U)
#define K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY1_SHIFT (3U)
#define K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY1_WIDTH (1U)
#define K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY1(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY1_SHIFT)) & K566_GPR0_GPR_RWF_4_ETH1_RGMII_DELAY1_MASK)

#define K566_GPR0_GPR_RWF_4_ETH1_TX_DELAY_TUNE_MASK (0x1F0U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_DELAY_TUNE_SHIFT (4U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_DELAY_TUNE_WIDTH (5U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_DELAY_TUNE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_4_ETH1_TX_DELAY_TUNE_SHIFT)) & K566_GPR0_GPR_RWF_4_ETH1_TX_DELAY_TUNE_MASK)

#define K566_GPR0_GPR_RWF_4_ETH1_TX_PD_MASK      (0x200U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_PD_SHIFT     (9U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_PD_WIDTH     (1U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_PD(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_4_ETH1_TX_PD_SHIFT)) & K566_GPR0_GPR_RWF_4_ETH1_TX_PD_MASK)

#define K566_GPR0_GPR_RWF_4_ETH1_TX_BYPASS_DLL_MASK (0x400U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_BYPASS_DLL_SHIFT (10U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_BYPASS_DLL_WIDTH (1U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_BYPASS_DLL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_4_ETH1_TX_BYPASS_DLL_SHIFT)) & K566_GPR0_GPR_RWF_4_ETH1_TX_BYPASS_DLL_MASK)

#define K566_GPR0_GPR_RWF_4_ETH1_TX_STABLE_OVERRIDE_MASK (0x800U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_STABLE_OVERRIDE_SHIFT (11U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_STABLE_OVERRIDE_WIDTH (1U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_STABLE_OVERRIDE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_4_ETH1_TX_STABLE_OVERRIDE_SHIFT)) & K566_GPR0_GPR_RWF_4_ETH1_TX_STABLE_OVERRIDE_MASK)

#define K566_GPR0_GPR_RWF_4_ETH1_TX_CLK_PRESENT_CLR_MASK (0x1000U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_CLK_PRESENT_CLR_SHIFT (12U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_CLK_PRESENT_CLR_WIDTH (1U)
#define K566_GPR0_GPR_RWF_4_ETH1_TX_CLK_PRESENT_CLR(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_4_ETH1_TX_CLK_PRESENT_CLR_SHIFT)) & K566_GPR0_GPR_RWF_4_ETH1_TX_CLK_PRESENT_CLR_MASK)

