zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR0.h
#define K566_GPR0_GPR_RWF_5_ETH2_TX_LOCK_ERR_CLR_MASK (0x2000U)
#define K566_GPR0_GPR_RWF_5_ETH2_TX_LOCK_ERR_CLR_SHIFT (13U)
#define K566_GPR0_GPR_RWF_5_ETH2_TX_LOCK_ERR_CLR_WIDTH (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_TX_LOCK_ERR_CLR(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_TX_LOCK_ERR_CLR_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_TX_LOCK_ERR_CLR_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_TX_EN_REQ_MASK  (0x4000U)
#define K566_GPR0_GPR_RWF_5_ETH2_TX_EN_REQ_SHIFT (14U)
#define K566_GPR0_GPR_RWF_5_ETH2_TX_EN_REQ_WIDTH (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_TX_EN_REQ(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_TX_EN_REQ_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_TX_EN_REQ_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_TX_COUNTER_RST_MASK (0x8000U)
#define K566_GPR0_GPR_RWF_5_ETH2_TX_COUNTER_RST_SHIFT (15U)
#define K566_GPR0_GPR_RWF_5_ETH2_TX_COUNTER_RST_WIDTH (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_TX_COUNTER_RST(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_TX_COUNTER_RST_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_TX_COUNTER_RST_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_RX_DELAY_TUNE_MASK (0x1F0000U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_DELAY_TUNE_SHIFT (16U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_DELAY_TUNE_WIDTH (5U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_DELAY_TUNE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_RX_DELAY_TUNE_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_RX_DELAY_TUNE_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_RX_PD_MASK      (0x200000U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_PD_SHIFT     (21U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_PD_WIDTH     (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_PD(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_RX_PD_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_RX_PD_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_RX_BYPASS_DLL_MASK (0x400000U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_BYPASS_DLL_SHIFT (22U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_BYPASS_DLL_WIDTH (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_BYPASS_DLL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_RX_BYPASS_DLL_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_RX_BYPASS_DLL_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_RX_STABLE_OVERRIDE_MASK (0x800000U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_STABLE_OVERRIDE_SHIFT (23U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_STABLE_OVERRIDE_WIDTH (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_STABLE_OVERRIDE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_RX_STABLE_OVERRIDE_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_RX_STABLE_OVERRIDE_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_RX_CLK_PRESENT_CLR_MASK (0x1000000U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_CLK_PRESENT_CLR_SHIFT (24U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_CLK_PRESENT_CLR_WIDTH (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_CLK_PRESENT_CLR(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_RX_CLK_PRESENT_CLR_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_RX_CLK_PRESENT_CLR_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_RX_LOCK_ERR_CLR_MASK (0x2000000U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_LOCK_ERR_CLR_SHIFT (25U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_LOCK_ERR_CLR_WIDTH (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_LOCK_ERR_CLR(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_RX_LOCK_ERR_CLR_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_RX_LOCK_ERR_CLR_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_RX_EN_REQ_MASK  (0x4000000U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_EN_REQ_SHIFT (26U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_EN_REQ_WIDTH (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_EN_REQ(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_RX_EN_REQ_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_RX_EN_REQ_MASK)

#define K566_GPR0_GPR_RWF_5_ETH2_RX_COUNTER_RST_MASK (0x8000000U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_COUNTER_RST_SHIFT (27U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_COUNTER_RST_WIDTH (1U)
#define K566_GPR0_GPR_RWF_5_ETH2_RX_COUNTER_RST(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_5_ETH2_RX_COUNTER_RST_SHIFT)) & K566_GPR0_GPR_RWF_5_ETH2_RX_COUNTER_RST_MASK)
/*! @} */

/*! @name GPR_RWF_6 - Read Write FUNC 6 */
/*! @{ */

#define K566_GPR0_GPR_RWF_6_TS_SEL_MASK          (0x1U)
#define K566_GPR0_GPR_RWF_6_TS_SEL_SHIFT         (0U)
#define K566_GPR0_GPR_RWF_6_TS_SEL_WIDTH         (1U)
#define K566_GPR0_GPR_RWF_6_TS_SEL(x)            (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_6_TS_SEL_SHIFT)) & K566_GPR0_GPR_RWF_6_TS_SEL_MASK)

#define K566_GPR0_GPR_RWF_6_TS_EN_MASK           (0x2U)
#define K566_GPR0_GPR_RWF_6_TS_EN_SHIFT          (1U)
#define K566_GPR0_GPR_RWF_6_TS_EN_WIDTH          (1U)
#define K566_GPR0_GPR_RWF_6_TS_EN(x)             (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_6_TS_EN_SHIFT)) & K566_GPR0_GPR_RWF_6_TS_EN_MASK)

#define K566_GPR0_GPR_RWF_6_ENET0_TX_ALT_HARD_EN_MASK (0x8U)
#define K566_GPR0_GPR_RWF_6_ENET0_TX_ALT_HARD_EN_SHIFT (3U)
#define K566_GPR0_GPR_RWF_6_ENET0_TX_ALT_HARD_EN_WIDTH (1U)
#define K566_GPR0_GPR_RWF_6_ENET0_TX_ALT_HARD_EN(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_6_ENET0_TX_ALT_HARD_EN_SHIFT)) & K566_GPR0_GPR_RWF_6_ENET0_TX_ALT_HARD_EN_MASK)

#define K566_GPR0_GPR_RWF_6_ENET1_TX_ALT_HARD_EN_MASK (0x20U)
#define K566_GPR0_GPR_RWF_6_ENET1_TX_ALT_HARD_EN_SHIFT (5U)
#define K566_GPR0_GPR_RWF_6_ENET1_TX_ALT_HARD_EN_WIDTH (1U)
#define K566_GPR0_GPR_RWF_6_ENET1_TX_ALT_HARD_EN(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_6_ENET1_TX_ALT_HARD_EN_SHIFT)) & K566_GPR0_GPR_RWF_6_ENET1_TX_ALT_HARD_EN_MASK)

#define K566_GPR0_GPR_RWF_6_ENET2_TX_ALT_HARD_EN_MASK (0x80U)
#define K566_GPR0_GPR_RWF_6_ENET2_TX_ALT_HARD_EN_SHIFT (7U)
#define K566_GPR0_GPR_RWF_6_ENET2_TX_ALT_HARD_EN_WIDTH (1U)
#define K566_GPR0_GPR_RWF_6_ENET2_TX_ALT_HARD_EN(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_RWF_6_ENET2_TX_ALT_HARD_EN_SHIFT)) & K566_GPR0_GPR_RWF_6_ENET2_TX_ALT_HARD_EN_MASK)
/*! @} */

/*! @name GPR_ROF_0 - Read Only FUNC 0 */
/*! @{ */

#define K566_GPR0_GPR_ROF_0_RTIS_ACK_MASK        (0x3FFU)
#define K566_GPR0_GPR_ROF_0_RTIS_ACK_SHIFT       (0U)
#define K566_GPR0_GPR_ROF_0_RTIS_ACK_WIDTH       (10U)
#define K566_GPR0_GPR_ROF_0_RTIS_ACK(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_0_RTIS_ACK_SHIFT)) & K566_GPR0_GPR_ROF_0_RTIS_ACK_MASK)
/*! @} */

/*! @name GPR_ROF_1 - Read Only FUNC 1 */
/*! @{ */

#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT0_MASK   (0x1U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT0_SHIFT  (0U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT0_WIDTH  (1U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT0(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH0_TX_STAT0_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH0_TX_STAT0_MASK)

#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT2_MASK   (0x4U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT2_SHIFT  (2U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT2_WIDTH  (1U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT2(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH0_TX_STAT2_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH0_TX_STAT2_MASK)

#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT3_MASK   (0x8U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT3_SHIFT  (3U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT3_WIDTH  (1U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT3(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH0_TX_STAT3_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH0_TX_STAT3_MASK)

