zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR0.h
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT4_MASK   (0x10U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT4_SHIFT  (4U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT4_WIDTH  (1U)
#define K566_GPR0_GPR_ROF_1_ETH0_TX_STAT4(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH0_TX_STAT4_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH0_TX_STAT4_MASK)

#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT5_MASK   (0x20U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT5_SHIFT  (5U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT5_WIDTH  (1U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT5(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH0_RX_STAT5_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH0_RX_STAT5_MASK)

#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT7_MASK   (0x80U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT7_SHIFT  (7U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT7_WIDTH  (1U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT7(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH0_RX_STAT7_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH0_RX_STAT7_MASK)

#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT8_MASK   (0x100U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT8_SHIFT  (8U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT8_WIDTH  (1U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT8(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH0_RX_STAT8_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH0_RX_STAT8_MASK)

#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT9_MASK   (0x200U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT9_SHIFT  (9U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT9_WIDTH  (1U)
#define K566_GPR0_GPR_ROF_1_ETH0_RX_STAT9(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH0_RX_STAT9_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH0_RX_STAT9_MASK)

#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT10_MASK  (0x400U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT10_SHIFT (10U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT10_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT10(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH1_TX_STAT10_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH1_TX_STAT10_MASK)

#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT12_MASK  (0x1000U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT12_SHIFT (12U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT12_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT12(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH1_TX_STAT12_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH1_TX_STAT12_MASK)

#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT13_MASK  (0x2000U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT13_SHIFT (13U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT13_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT13(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH1_TX_STAT13_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH1_TX_STAT13_MASK)

#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT14_MASK  (0x4000U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT14_SHIFT (14U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT14_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH1_TX_STAT14(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH1_TX_STAT14_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH1_TX_STAT14_MASK)

#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT15_MASK  (0x8000U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT15_SHIFT (15U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT15_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT15(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH1_RX_STAT15_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH1_RX_STAT15_MASK)

#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT17_MASK  (0x20000U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT17_SHIFT (17U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT17_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT17(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH1_RX_STAT17_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH1_RX_STAT17_MASK)

#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT18_MASK  (0x40000U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT18_SHIFT (18U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT18_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT18(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH1_RX_STAT18_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH1_RX_STAT18_MASK)

#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT19_MASK  (0x80000U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT19_SHIFT (19U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT19_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH1_RX_STAT19(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH1_RX_STAT19_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH1_RX_STAT19_MASK)

#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT20_MASK  (0x100000U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT20_SHIFT (20U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT20_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT20(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH2_TX_STAT20_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH2_TX_STAT20_MASK)

#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT22_MASK  (0x400000U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT22_SHIFT (22U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT22_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT22(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH2_TX_STAT22_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH2_TX_STAT22_MASK)

#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT23_MASK  (0x800000U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT23_SHIFT (23U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT23_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT23(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH2_TX_STAT23_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH2_TX_STAT23_MASK)

#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT24_MASK  (0x1000000U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT24_SHIFT (24U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT24_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH2_TX_STAT24(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH2_TX_STAT24_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH2_TX_STAT24_MASK)

#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT25_MASK  (0x2000000U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT25_SHIFT (25U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT25_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT25(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH2_RX_STAT25_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH2_RX_STAT25_MASK)

#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT27_MASK  (0x8000000U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT27_SHIFT (27U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT27_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT27(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH2_RX_STAT27_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH2_RX_STAT27_MASK)

#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT28_MASK  (0x10000000U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT28_SHIFT (28U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT28_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT28(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH2_RX_STAT28_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH2_RX_STAT28_MASK)

#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT29_MASK  (0x20000000U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT29_SHIFT (29U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT29_WIDTH (1U)
#define K566_GPR0_GPR_ROF_1_ETH2_RX_STAT29(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR0_GPR_ROF_1_ETH2_RX_STAT29_SHIFT)) & K566_GPR0_GPR_ROF_1_ETH2_RX_STAT29_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group K566_GPR0_Register_Masks */

/*!
 * @}
 */ /* end of group K566_GPR0_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_K566_GPR0_H_) */
